Revit 2024 API
StructuralFramingUtils Class
 A collection of Structural Framing Utilities.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public static class StructuralFramingUtils
Visual Basic
Public NotInheritable Class StructuralFramingUtils
Visual C++
public ref class StructuralFramingUtils abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralFramingUtils
See Also
StructuralFramingUtils Members
Autodesk.Revit.DB.Structure Namespace